In [1]:
# ICC Cricket Analysis World Cup 2023 - Data Analysis Project
### Objective
'''This project analyzes the ICC Cricket World Cup 2023 using match-level, batting, and bowling datasets
   to uncover key insights related to team performance, player performance, and match outcomes.'''

'This project analyzes the ICC Cricket World Cup 2023 using match-level, batting, and bowling datasets\n   to uncover key insights related to team performance, player performance, and match outcomes.'

In [2]:
import pandas as pd

In [3]:
# Data Loading

In [4]:

matches=pd.read_csv("CWC2023.csv")
batting=pd.read_csv("icc_wc_23_bat.csv")
bowling=pd.read_csv("icc_wc_23_bowl.csv")
matches.head()

,Match_No,Team_1,Team_2,Venue,Toss,Choice,Innings1_Run,Innings1_Balls,Innings1_Wickets,Innings2_Run,Innings2_Balls,Innings2_Wickets,Winner,Margin_Runs_or_Wickets
0,1,New Zealand,United Kingdom,Ahemedabad,New Zealand,Ball,282,300,9,283,218,1,New Zealand,9W
1,2,Pakistan,Netherlands,Hyderabad,Netherlands,Ball,286,294,10,205,246,10,Pakistan,81R
2,3,Bangladesh,Afghanistan,Dharamshala,Bangladesh,Ball,156,224,10,158,208,4,Bangladesh,6W
3,4,South Africa,Sri Lanka,New Delhi,SriLanka,Ball,428,300,5,326,269,10,South Africa,102R
4,5,India,Australia,Chennai,Australia,Bat,199,297,10,201,248,4,India,6W

In [5]:
matches.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48 entries, 0 to 47
Data columns (total 14 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Match_No                48 non-null     int64
 1   Team_1                  48 non-null     object
 2   Team_2                  48 non-null     object
 3   Venue                   48 non-null     object
 4   Toss                    48 non-null     object
 5   Choice                  48 non-null     object
 6   Innings1_Run            48 non-null     int64
 7   Innings1_Balls          48 non-null     int64
 8   Innings1_Wickets        48 non-null     int64
 9   Innings2_Run            48 non-null     int64
 10  Innings2_Balls          48 non-null     int64
 11  Innings2_Wickets        48 non-null     int64
 12  Winner                  48 non-null     object
 13  Margin_Runs_or_Wickets  48 non-null     object
dtypes: int64(7), object(7)
memory usage: 5.4+ KB

In [6]:
batting.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 875 entries, 0 to 874
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   player       875 non-null    object
 1   dismissal    875 non-null    object
 2   runs         875 non-null    int64
 3   balls        875 non-null    int64
 4   minutes      875 non-null    int64
 5   4s           875 non-null    int64
 6   6s           875 non-null    int64
 7   strike_rate  875 non-null    float64
 8   team         875 non-null    object
 9   opponent     875 non-null    object
 10  innings      875 non-null    int64
 11  match_id     875 non-null    int64
dtypes: float64(1), int64(7), object(4)
memory usage: 82.2+ KB

In [7]:
bowling.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 574 entries, 0 to 573
Data columns (total 15 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   player    574 non-null    object
 1   overs     574 non-null    float64
 2   maidens   574 non-null    int64
 3   runs      574 non-null    int64
 4   wickets   574 non-null    int64
 5   run_rate  574 non-null    float64
 6   0s        574 non-null    int64
 7   4s        574 non-null    int64
 8   6s        574 non-null    int64
 9   wd        574 non-null    int64
 10  nb        574 non-null    int64
 11  team      574 non-null    object
 12  opponent  574 non-null    object
 13  innings   574 non-null    int64
 14  match_id  574 non-null    int64
dtypes: float64(2), int64(10), object(3)
memory usage: 67.4+ KB

In [8]:
def clean_team_names(df,column):
    df[column]=df[column].str.strip().str.title()
    return df

matches=clean_team_names(matches,'Team_1')
matches=clean_team_names(matches,'Team_2')
matches=clean_team_names(matches,'Winner')

batting=clean_team_names(batting,'team')
batting=clean_team_names(batting,'opponent')

bowling=clean_team_names(bowling,'team')
bowling=clean_team_names(bowling,'opponent')

In [9]:
# Batting Analysis

In [10]:
# Top run scorers
top_run_scorers=(batting.groupby('player')["runs"].sum().reset_index().sort_values(by="runs",ascending=False))
top_run_scorers.head(10)

                    player  runs
143            Virat Kohli   765
113           Rohit Sharma   597
103        Quinton de Kock   594
104        Rachin Ravindra   578
18          Daryl Mitchell   552
21            David Warner   535
125           Shreyas Iyer   530
56                KL Rahul   452
108  Rassie van der Dussen   448
82          Mitchell Marsh   441

In [11]:
# Qualified batters
qualified_batters=batting[batting['balls']>100]

top_strike_rate=(batting.groupby('player')["strike_rate"].mean().reset_index().sort_values(by="strike_rate",ascending=False))
top_strike_rate.head(10)

               player  strike_rate
22       David Willey   163.933333
4       Aiden Markram   151.525000
37      Hardik Pandya   137.500000
110      Reece Topley   132.140000
113      Rohit Sharma   127.897273
20       David Miller   123.346000
43   Heinrich Klaasen   123.195000
36       Gus Atkinson   122.220000
74     Marcus Stoinis   121.516000
21       David Warner   119.574545

In [12]:
# Top six hiters
top_six_hiters=(batting.groupby("player")["6s"].sum().reset_index().sort_values(by="6s",ascending=False))
top_six_hiters.head(10)

               player  6s
113      Rohit Sharma  31
21       David Warner  24
125      Shreyas Iyer  24
34      Glenn Maxwell  22
18     Daryl Mitchell  22
82     Mitchell Marsh  21
103   Quinton de Kock  21
20       David Miller  20
43   Heinrich Klaasen  19
31       Fakhar Zaman  18

In [13]:
batting.columns=batting.columns.str.strip()
print(batting.columns)

Index(['player', 'dismissal', 'runs', 'balls', 'minutes', '4s', '6s',
       'strike_rate', 'team', 'opponent', 'innings', 'match_id'],
      dtype='object')

In [14]:
# Boundry percentage

In [15]:
batting['boundaries']=batting['4s']*4 + batting['6s']*6

In [16]:
def safe_boundary_percent(x):
    runs_sum = x['runs'].sum()
    if runs_sum == 0:
        return 0
    return x['boundaries'].sum() / runs_sum * 100

boundary_percent = (
    batting.groupby('player')
    .apply(safe_boundary_percent)
    .reset_index(name='boundary_percentage')
    .sort_values(by='boundary_percentage', ascending=False)
)
boundary_percent.head(10)

                 player  boundary_percentage
64        Lahiru Kumara           100.000000
29      Dushan Hemantha           100.000000
89       Mohammad Wasim            86.956522
67      Lockie Ferguson            85.714286
38           Haris Rauf            83.018868
22         David Willey            82.051282
40            Hasan Ali            80.000000
132  Tanzim Hasan Sakib            80.000000
36         Gus Atkinson            75.675676
113        Rohit Sharma            75.376884

In [17]:
# which team scored the most runs

In [18]:

team_runs=(batting.groupby('team')['runs'].sum().reset_index().sort_values('runs',ascending=False))
team_runs

           team  runs
4         India  3038
1     Australia  2945
8  South Africa  2773
6   New Zealand  2712
7      Pakistan  2220
3       England  2135
0   Afghanistan  1990
2    Bangladesh  1944
9     Sri Lanka  1942
5   Netherlands  1728

In [19]:
# BOWLING ANALYSIS

In [20]:
# top wicket takers
top_wicket_takers=(bowling.groupby('player')['wickets'].sum().reset_index().sort_values('wickets',ascending=False))
top_wicket_takers.head(10)

                 player  wickets
63       Mohammed Shami       24
0            Adam Zampa       23
18   Dilshan Madushanka       21
34       Jasprit Bumrah       20
23       Gerald Coetzee       20
86  Shaheen Shah Afridi       18
50         Marco Jansen       17
36       Josh Hazlewood       16
58       Mitchell Starc       16
28           Haris Rauf       16

In [21]:
# BEST ECONOMY RATE
bowling['economy']=bowling['runs']/bowling['overs']

In [22]:
best_economy=(bowling.groupby('player').apply(lambda x:pd.Series({'runs':x['runs'].sum(),
                                                                  'overs':x['overs'].sum(),
                                                                  'economy':x['runs'].sum()/x['overs'].sum()
                                                                  if x['overs'].sum() != 0
                                                                  else 0})).reset_index())

In [23]:
best_economy=best_economy[best_economy['overs']>=20]
best_economy.sort_values(by='economy')

                player   runs  overs   economy
34      Jasprit Bumrah  373.0   91.5  4.076503
60       Mohammad Nabi  254.0   61.3  4.143556
39      Keshav Maharaj  370.0   89.0  4.157303
77     Ravindra Jadeja  398.0   92.9  4.284177
40       Kuldeep Yadav  424.0   95.1  4.458465
..                 ...    ...    ...       ...
68         Nasum Ahmed  172.0   24.3  7.078189
99           Usama Mir  248.0   35.0  7.085714
7   Azmatullah Omarzai  270.0   38.0  7.105263
8         Bas de Leede  487.0   67.0  7.268657
96         Tim Southee  256.0   33.0  7.757576

[67 rows x 4 columns]

In [24]:
# creating the balls column
def overs_to_balls(overs):
    full_overs=int(overs)
    balls_part=round((overs - full_overs)*10)
    return full_overs*6 + balls_part

bowling['balls']=bowling['overs'].apply(overs_to_balls)

In [25]:
# BOWLING STRIKE RATE
bowling_strike_rate=(bowling.groupby('player').apply(lambda x: pd.Series({'balls':x['balls'].sum(),
                                                                          'wickets':x['wickets'].sum(),
                                                                          'strike_rate':(x['balls'].sum()/x['wickets'].sum())
                                                                          if x['wickets'].sum()!= 0
                                                                               else None }))
                                                                               .reset_index()
                                                                               .sort_values(by='strike_rate'))
bowling_strike_rate

                 player  balls  wickets  strike_rate
80         Rohit Sharma    5.0      1.0     5.000000
63       Mohammed Shami  293.0     24.0    12.208333
23       Gerald Coetzee  381.0     20.0    19.050000
27        Hardik Pandya   99.0      5.0    19.800000
94   Tanzim Hasan Sakib   60.0      3.0    20.000000
..                  ...    ...      ...          ...
81           Ryan Klein   42.0      0.0          NaN
89         Shariz Ahmad   12.0      0.0          NaN
91         Shubman Gill   12.0      0.0          NaN
92     Suryakumar Yadav   12.0      0.0          NaN
100     Vikramjit Singh   42.0      0.0          NaN

[102 rows x 4 columns]

In [26]:
# bowling average
bowling_avg=(bowling.groupby('player').apply(lambda x:pd.Series({'runs':x['runs'].sum(),
                                                                 'wickets':x['wickets'].sum(),
                                                                 'average':x['runs'].sum()/x['wickets'].sum()
                                                                 if x['wickets'].sum() != 0
                                                                 else None})).reset_index().sort_values(by='average'))
bowling_avg

               player   runs  wickets    average
80       Rohit Sharma    7.0      1.0   7.000000
63     Mohammed Shami  257.0     24.0  10.708333
101       Virat Kohli   15.0      1.0  15.000000
5      Angelo Mathews  107.0      6.0  17.833333
34     Jasprit Bumrah  373.0     20.0  18.650000
..                ...    ...      ...        ...
81         Ryan Klein   41.0      0.0        NaN
89       Shariz Ahmad   13.0      0.0        NaN
91       Shubman Gill   11.0      0.0        NaN
92   Suryakumar Yadav   17.0      0.0        NaN
100   Vikramjit Singh   52.0      0.0        NaN

[102 rows x 4 columns]

In [27]:
# which team took most wickets
team_wickets = (bowling.groupby('team')['wickets']
                .sum()
                .sort_values(ascending=False)
                .reset_index())
team_wickets

           team  wickets
0         India       99
1  South Africa       88
2     Australia       86
3   New Zealand       71
4       England       65
5      Pakistan       65
6   Netherlands       62
7   Afghanistan       53
8    Bangladesh       51
9     Sri Lanka       50

In [28]:
# tean economy comparison
team_economy = (bowling.groupby('team').apply(lambda x: x['runs'].sum() / x['overs'].sum())
                .reset_index(name='team_economy')
                .sort_values(by='team_economy'))
team_economy

           team  team_economy
4         India      4.811443
0   Afghanistan      5.372087
8  South Africa      5.474676
1     Australia      5.516757
3       England      5.816825
6   New Zealand      5.930543
2    Bangladesh      6.080605
5   Netherlands      6.115682
7      Pakistan      6.219098
9     Sri Lanka      6.455393

In [29]:
# MATCHES ANALYSIS

In [30]:
matches.head()

,Match_No,Team_1,Team_2,Venue,Toss,Choice,Innings1_Run,Innings1_Balls,Innings1_Wickets,Innings2_Run,Innings2_Balls,Innings2_Wickets,Winner,Margin_Runs_or_Wickets
0,1,New Zealand,United Kingdom,Ahemedabad,New Zealand,Ball,282,300,9,283,218,1,New Zealand,9W
1,2,Pakistan,Netherlands,Hyderabad,Netherlands,Ball,286,294,10,205,246,10,Pakistan,81R
2,3,Bangladesh,Afghanistan,Dharamshala,Bangladesh,Ball,156,224,10,158,208,4,Bangladesh,6W
3,4,South Africa,Sri Lanka,New Delhi,SriLanka,Ball,428,300,5,326,269,10,South Africa,102R
4,5,India,Australia,Chennai,Australia,Bat,199,297,10,201,248,4,India,6W

In [31]:
# toss vs match result
matches['Toss_helped']=matches['Toss']==matches['Winner']

Toss_impact=matches['Toss_helped'].value_counts()
Toss_impact

False    29
True     19
Name: Toss_helped, dtype: int64

In [32]:
matches['bat_first'] = matches.apply(lambda x: x['Toss'] if x['Choice'] == 'Bat' else
                       (x['Team_1'] if x['Toss'] != x['Team_1'] else x['Team_2']),
                       axis=1)

In [33]:
matches['bat_first_winner']=matches['bat_first']==matches['Winner']

In [34]:
matches['bat_first_winner'].value_counts()

False    25
True     23
Name: bat_first_winner, dtype: int64

In [35]:
# TEAM WISE TOTAL RUNS

# team 1 total runs
team1_runs=matches.groupby('Team_1')['Innings1_Run'].sum()

# team 2 total runs
team2_runs=matches.groupby('Team_2')['Innings2_Run'].sum()

team_total_runs=team1_runs.add(team2_runs).sort_values(ascending=False)
team_total_runs

Team_1
India             3151
Australia         3076
South Africa      2896
New Zealand       2659
Pakistan          2523
United Kingdom    2250
Afghanistan       2096
Bangladesh        2058
Sri Lanka         2055
Netherlands       1865
dtype: int64

In [36]:
# TEAM WISE TOTAL WICKETS

# team 1 wicket lost
team1_wkts = matches.groupby('Team_1')['Innings1_Wickets'].sum()

# team 2 wicket lost
team2_wkts = matches.groupby('Team_2')['Innings2_Wickets'].sum()

team_total_wkts = team1_wkts.add(team2_wkts).sort_values(ascending=False)

team_total_wkts

Team_1
Sri Lanka         172
Australia          94
India              80
New Zealand        77
Netherlands        76
South Africa       75
United Kingdom     70
Pakistan           69
Afghanistan        65
Bangladesh         60
dtype: int64

In [37]:
# TEAM-WISE RUN RATE

In [38]:
teams = pd.Series(pd.concat([matches['Team_1'], matches['Team_2']]).unique(),name='Team')

In [39]:
# CALCULATING RUNS AND BALLS
team_rr = pd.DataFrame(teams)

team_rr['Runs'] = team_rr['Team'].apply(lambda t:matches[matches['Team_1'] == t]['Innings1_Run'].sum() +
                                        matches[matches['Team_2'] == t]['Innings2_Run'].sum())

team_rr['Balls'] = team_rr['Team'].apply(lambda t:matches[matches['Team_1'] == t]['Innings1_Balls'].sum() +
                                         matches[matches['Team_2'] == t]['Innings2_Balls'].sum())

In [40]:
# CALCULATE RUN RATE FOR MATCHES
team_rr['Run_Rate'] = team_rr.apply(lambda x: x['Runs'] / (x['Balls'] / 6) if x['Balls'] != 0 else 0,axis=1)

In [41]:
team_rr.sort_values(by='Run_Rate', ascending=False)

             Team  Runs  Balls  Run_Rate
9       Sri Lanka  2055   1938  6.362229
5  United Kingdom  2250   2145  6.293706
3    South Africa  2896   2784  6.241379
1        Pakistan  2523   2460  6.153659
4           India  3151   3212  5.886052
0     New Zealand  2659   2727  5.850385
7       Australia  3076   3245  5.687519
2      Bangladesh  2058   2314  5.336214
6     Afghanistan  2096   2367  5.313054
8     Netherlands  1865   2199  5.088677

In [42]:
# Batting first vs Chase
matches['winning_innings'] = matches.apply(lambda x: 'Innings1' if x['Innings1_Run'] > x['Innings2_Run'] else 'Innings2',axis=1)

In [43]:
matches[['Innings1_Run', 'Innings2_Run', 'winning_innings']].head()

   Innings1_Run  Innings2_Run winning_innings
0           282           283        Innings2
1           286           205        Innings1
2           156           158        Innings2
3           428           326        Innings1
4           199           201        Innings2

In [44]:
bat_vs_chase = matches['winning_innings'].value_counts(normalize=True) * 100
bat_vs_chase

Innings2    50.0
Innings1    50.0
Name: winning_innings, dtype: float64

In [45]:
# MAIN INSIGHTS
''' 
- A few players stood out as consistent top runners across the tournament.
- Players with higher strike rates often had a strong impact.
- Even in high-scoring games, some bowlers managed to keep their economy rates under control.
- The analysis shows that winning the toss did not necessarily lead to winning the match.
- Teams that performed well in both batting and bowling appeared more consistent overall.
'''

' \n- A few players stood out as consistent top runners across the tournament.\n- Players with higher strike rates often had a strong impact.\n- Even in high-scoring games, some bowlers managed to keep their economy rates under control.\n- The analysis shows that winning the toss did not necessarily lead to winning the match.\n- Teams that performed well in both batting and bowling appeared more consistent overall.\n'